Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_СверкаСБанком</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаталогиСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Каталог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСверки</Name>
							<Comment>Значения перечислены в соответствии РезультатыСверки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком/Ext/ObjectModule.bsl
Перем ДополнительныеСвойства Экспорт;
Перем ОписаниеРезультатовСверки;

#Область Интерфейс_внешнего_отчета

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Сверка с банком",
		"1.14",
		"",
		Истина);
		
	// Команды
	
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ФормированиеИОтправкаОтчета", "Формирование и отправка отчета", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	// Заполнение реквизитов обработки
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКоманды); 
	
	// Обработка команд
	
	Если ИдентификаторКоманды = "ФормированиеИОтправкаОтчета" Тогда
		
		#Область Обработка_команды
		
		Если Не ПараметрыКоманды.Свойство("Получатели") ИЛИ Не ЗначениеЗаполнено(ПараметрыКоманды.Получатели) Тогда
			ЗарегистрироватьОшибки("Не заполнен обязательный параметр: 'Получатели'");
			Возврат;
		КонецЕсли;
		
		// Отправляем по рабочим дням за Т-1 
		
		ОтчетнаяДата	= Неопределено;
		ТекущийДень		= НачалоДня(ТекущаяДатаСеанса());
		
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущийДень) Тогда
			ОтчетнаяДата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущийДень - 1, -1);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтчетнаяДата) Тогда
			
			ЭтотОбъект.Период = Новый СтандартныйПериод(ОтчетнаяДата, ОтчетнаяДата);
			
			Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда 
				ЗарегистрироватьОшибки("Не заполнены обязательные параметры.", ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Истина));
				Возврат;
			КонецЕсли;
			
			ЗарегистрироватьСессиюСтатистики(ИдентификаторКоманды);
			
			СформироватьИОтправитьОтчет(ПараметрыКоманды.Получатели);
			
			ЗарегистрироватьОкончаниеСессииСтатистики(ИдентификаторКоманды);
			
		КонецЕсли;
		
		#КонецОбласти
			
	Иначе
		
		ВызватьИсключение СтрШаблон("Неизвестный идентификатор команды: ""%1""", ИдентификаторКоманды);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьИОтправитьОтчет(Получатели)
	
	ОшибкаФормирования = Ложь;
	
	// Формируем отчет
	
	СообщенияДоРасчета = ПолучитьСообщенияПользователю(Истина);
	
	Попытка
	
		ВыполнитьСверку();
		
		ДокументРезультат = СформироватьОтчетОРезультатахСверки();
	
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), , , , ОшибкаФормирования);
		
	КонецПопытки;
	
	ТекстСообщенийПользователю = ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Истина);
	
	ОбщегоНазначения.ВывестиСообщенияПользователю(СообщенияДоРасчета);
	
	Если ОшибкаФормирования Тогда
		ЗарегистрироватьОшибки(ТекстСообщенийПользователю);
	КонецЕсли;
	
	// Формируем письмо
	
	ПредставлениеПериода = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",		Получатели);
	ПараметрыПисьма.Вставить("Тема",		СтрШаблон("Результаты сверки с данными банка (%1)", ЭтотОбъект.Организация));
	ПараметрыПисьма.Вставить("Тело",		"Во вложении отчет за " + ПредставлениеПериода);
	ПараметрыПисьма.Вставить("ТипТекста",	"HTML");
	ПараметрыПисьма.Вставить("Вложения",	Новый Соответствие);
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗарегистрированныеОшибки") Тогда
		
		// Уведомим об ошибках
		
		ПараметрыПисьма.Кому = Получатели;
		ПараметрыПисьма.Тело =
			СтрШаблон(
				"Ошибка формирования отчета!
				|
				|%1",
			СтрСоединить(ЭтотОбъект.ДополнительныеСвойства.ЗарегистрированныеОшибки, Символы.ПС));
		
	Иначе
		
		// Вложим файл с результатом отчета
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
		
		ПараметрыПисьма.Вложения.Вставить(
			СтрШаблон("Сверка с банком за %1.xlsx", ПредставлениеПериода),
			ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла)));
			
		УдалитьФайлы(ИмяВременногоФайла);
			
		// Выведем результат в тело письма, удаляя все невидимые области	
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
		
		Для НомерСтроки = -ДокументРезультат.ВысотаТаблицы По -1 Цикл
			ОбластьСтроки = ДокументРезультат.Область(-НомерСтроки, , -НомерСтроки);
			Если Не ОбластьСтроки.Видимость Тогда
				ДокументРезультат.УдалитьОбласть(ОбластьСтроки, ТипСмещенияТабличногоДокумента.ПоВертикали);	
			КонецЕсли;
		КонецЦикла;
		
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);

		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма.Тело = ТелоПисьма.ПолучитьТекст();
			
		УдалитьФайлы(ИмяВременногоФайла);
		
	КонецЕсли;
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма, , Истина);			
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибки(ОписаниеОшибки, Ошибки = Неопределено, СистемнаяОшибка = Истина)
	
	РегистрируемыеОшибки = РаботаСКоллекциями.ЗначениеВМассив(ОписаниеОшибки);
	
	Если Ошибки <> Неопределено Тогда
		РаботаСКоллекциями.ДополнитьМассив(РегистрируемыеОшибки, Ошибки); 
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		Источник = ЭтотОбъект.ДополнительныеСвойства.Источник;
	Иначе
		Источник = ЭтотОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Если СистемныеФункции.ЭтоФоновоеЗадание() Тогда
		
		Если СистемнаяОшибка
			ИЛИ Не ЭтотОбъект.ДополнительныеСвойства.Свойство("РегистрироватьВЖурналеОшибокТолькоСистемныеОшибки")
		Тогда
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(РегистрируемыеОшибки, Источник);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(РегистрируемыеОшибки, Символы.ПС));
		
	КонецЕсли;		
	
	// Запоминаем зарегистрированные ошибки
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗарегистрированныеОшибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗарегистрированныеОшибки", Новый Массив);
	КонецЕсли;
	
	РаботаСКоллекциями.ДополнитьМассив(ЭтотОбъект.ДополнительныеСвойства.ЗарегистрированныеОшибки, РегистрируемыеОшибки); 
	
КонецПроцедуры

#КонецОбласти

Функция ВариантыЗначенийРезультатаСверки() Экспорт
	
	ВариантыЗначений = Новый Структура;
	ВариантыЗначений.Вставить("НеСверялось", Новый Структура("Значение, Представление, Приоритет, ЦветТекста", 3, "Не сверялось", 1, "НейтральноКоричневый"));
	ВариантыЗначений.Вставить("Сверено",	 Новый Структура("Значение, Представление, Приоритет, ЦветТекста", 2, "Сверено", 2, "Зеленый"));
	ВариантыЗначений.Вставить("Расхождения", Новый Структура("Значение, Представление, Приоритет, ЦветТекста", 1, "Расхождения", 0, "Красный"));
	
	Возврат ВариантыЗначений;
	
КонецФункции

Процедура ЗаполнитьДанныеСверки(ДанныеСверки = Неопределено, ПерезаполнитьКаталогиСверки = Истина) Экспорт

	ЭтотОбъект.БанковскиеСчета.Очистить();	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ДанныеСверки = Неопределено Тогда
		
		#Область Помещаем_остатки_банковских_счетов_в_МВТ
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БанковскиеСчета.Ссылка КАК БанковскийСчет,
			|	БанковскиеСчета.Банк КАК Банк
			|ПОМЕСТИТЬ _БанковскиеСчета
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.Организация = &Организация
			|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
			|	И БанковскиеСчета.ЮрФизЛицо = &ЮрЛицоОрганизации
			|	И БанковскиеСчета.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.ДепозитныйСчет)
			|	И БанковскиеСчета.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетЭскроу)
			|	И (БанковскиеСчета.ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ БанковскиеСчета.ДатаОткрытия <= &ДатаОкончания)
			|	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ БанковскиеСчета.ДатаЗакрытия >= &ДатаНачала)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_БанковскиеСчета.БанковскийСчет, ОстаткиИОбороты.РасчетныйСчет) КАК БанковскийСчет,
			|	ЕСТЬNULL(_БанковскиеСчета.Банк, ОстаткиИОбороты.РасчетныйСчет.Банк) КАК Банк,
			|	ОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
			|	ОстаткиИОбороты.СуммаПриход КАК Приход,
			|	ОстаткиИОбороты.СуммаРасход КАК Расход,
			|	ОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
			|ПОМЕСТИТЬ _ДанныеСверки
			|ИЗ
			|	_БанковскиеСчета КАК _БанковскиеСчета
			|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОстаткиИОбороты.РасчетныйСчет КАК РасчетныйСчет,
			|			ОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
			|			ОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
			|			ОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
			|			ОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
			|					НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ),
			|					КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ),
			|					Период,
			|					,
			|					Организация = &Организация
			|						И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК ОстаткиИОбороты
			|		ГДЕ
			|			ОстаткиИОбороты.РасчетныйСчет.ЮрФизЛицо = &ЮрЛицоОрганизации
			|			И ОстаткиИОбороты.РасчетныйСчет.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.ДепозитныйСчет)
			|			И ОстаткиИОбороты.РасчетныйСчет.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетЭскроу)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ДенежныеСредстваПереданныеВОплатуПаев.РасчетныйСчет,
			|			ДенежныеСредстваПереданныеВОплатуПаев.СуммаНачальныйОстаток,
			|			ДенежныеСредстваПереданныеВОплатуПаев.СуммаПриход,
			|			ДенежныеСредстваПереданныеВОплатуПаев.СуммаРасход,
			|			ДенежныеСредстваПереданныеВОплатуПаев.СуммаКонечныйОстаток
			|		ИЗ
			|			РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ), КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ), Период, , Организация = &Организация) КАК ДенежныеСредстваПереданныеВОплатуПаев
			|		ГДЕ
			|			ДенежныеСредстваПереданныеВОплатуПаев.РасчетныйСчет.ЮрФизЛицо = &ЮрЛицоОрганизации) КАК ОстаткиИОбороты
			|		ПО (ОстаткиИОбороты.РасчетныйСчет = _БанковскиеСчета.БанковскийСчет)";
		
		Запрос.УстановитьПараметр("Организация",		ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ЮрЛицоОрганизации",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
		Запрос.УстановитьПараметр("ДатаНачала",			ЭтотОбъект.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",		ЭтотОбъект.Период.ДатаОкончания);

		Запрос.Выполнить();
		
		#КонецОбласти
		
	Иначе
		
		#Область Помещаем_переданные_данные_в_МВТ
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеСверки.БанковскийСчет КАК БанковскийСчет,
			|	ДанныеСверки.Банк КАК Банк,
			|	ДанныеСверки.НачальныйОстаток КАК НачальныйОстаток,
			|	ДанныеСверки.Приход КАК Приход,
			|	ДанныеСверки.Расход КАК Расход,
			|	ДанныеСверки.КонечныйОстаток КАК КонечныйОстаток
			|ПОМЕСТИТЬ _ДанныеСверки
			|ИЗ
			|	&ДанныеСверки КАК ДанныеСверки";
		
		Запрос.УстановитьПараметр("ДанныеСверки", ДанныеСверки);

		Запрос.Выполнить();
		
		#КонецОбласти
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеСверки.Банк КАК Банк,
		|	ПРЕДСТАВЛЕНИЕ(_ДанныеСверки.Банк) КАК ПредставлениеБанка
		|ИЗ
		|	_ДанныеСверки КАК _ДанныеСверки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Банк
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеСверки.БанковскийСчет КАК БанковскийСчет,
		|	ПРЕДСТАВЛЕНИЕ(_ДанныеСверки.БанковскийСчет) КАК ПредставлениеБанковскогоСчета,
		|	_ДанныеСверки.Банк КАК Банк,
		|	_ДанныеСверки.НачальныйОстаток КАК НачальныйОстаток,
		|	_ДанныеСверки.Приход КАК Приход,
		|	_ДанныеСверки.Расход КАК Расход,
		|	_ДанныеСверки.КонечныйОстаток КАК КонечныйОстаток,
		|	&РезультатСверки КАК РезультатСверки
		|ИЗ
		|	_ДанныеСверки КАК _ДанныеСверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК СчетаУчетКоторыхВедетсяВДругойСистеме
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК СвойствоУчетНеВедется
		|			ПО (СвойствоУчетНеВедется.Ссылка = СчетаУчетКоторыхВедетсяВДругойСистеме.Свойство)
		|				И (СвойствоУчетНеВедется.Ключ = ""УчетНеВедется"")
		|		ПО (СчетаУчетКоторыхВедетсяВДругойСистеме.Объект = _ДанныеСверки.БанковскийСчет)
		|			И (СчетаУчетКоторыхВедетсяВДругойСистеме.Значение = ИСТИНА)
		|ГДЕ
		|	(НЕ &ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме
		|			ИЛИ СчетаУчетКоторыхВедетсяВДругойСистеме.Объект ЕСТЬ NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Банк,
		|	БанковскийСчет
		|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Запрос.УстановитьПараметр("ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме",	ЭтотОбъект.ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме);
	Запрос.УстановитьПараметр("РезультатСверки",								ОписаниеРезультатовСверки.НеСверялось.Значение);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Банки			= РезультатПакета[РезультатПакета.ВГраница() - 1].Выгрузить();
	ОстаткиИОбороты	= РезультатПакета[РезультатПакета.ВГраница()].Выгрузить();
	
	ЭтотОбъект.БанковскиеСчета.Загрузить(ОстаткиИОбороты);
	
	ЗаполнитьШаблоныКаталогов(Банки, ПерезаполнитьКаталогиСверки);
	
КонецПроцедуры

Процедура ЗаполнитьШаблоныКаталогов(Банки = Неопределено, ПерезаполнитьКаталогиСверки = Истина) Экспорт
	
	// Заполним каталоги сверки
	
	Если Не ПерезаполнитьКаталогиСверки Тогда
		ТекущиеКаталоги = ЭтотОбъект.КаталогиСверки.Выгрузить();
	КонецЕсли;
	
	Если Банки <> Неопределено Тогда
		ЭтотОбъект.КаталогиСверки.Загрузить(Банки);
	КонецЕсли;
	
	Для Каждого СтрокаКаталога Из ЭтотОбъект.КаталогиСверки Цикл
		
		Если Не ПерезаполнитьКаталогиСверки Тогда
			СтрокаБанкаБыла = ТекущиеКаталоги.Найти(СтрокаКаталога.Банк, "Банк");
			Если СтрокаБанкаБыла <> Неопределено Тогда
				СтрокаКаталога.Каталог = СтрокаБанкаБыла.Каталог;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		КлючНастройкиБанка = Неопределено;
		
		Если СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхГПБ";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_МКБ") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхМКБ";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_Руснар") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхРНБ";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_Сбер") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхСбербанк";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ВТБ") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхВТБ";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_Зенит") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхЗенит";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ВБРР") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхВБРР";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_МТС") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхМТС";
		ИначеЕсли СтрокаКаталога.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ДомРФ") Тогда
			КлючНастройкиБанка = "ВнешниеОбработки._СверкаСБанком.КаталогДанныхДомРФ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КлючНастройкиБанка) Тогда
			Если КонецДня(ЭтотОбъект.Период.ДатаНачала) = КонецДня(ЭтотОбъект.Период.ДатаОкончания) Тогда 
				СтрокаКаталога.Каталог = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации(КлючНастройкиБанка, Организация, ЭтотОбъект.Период.ДатаНачала);	
			Иначе
				СтрокаКаталога.Каталог = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации(КлючНастройкиБанка, Организация);	
			КонецЕсли;				
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ВыполнитьСверку(ДанныеСверки = Неопределено, ПараметрыСверки = Неопределено, ПерезаполнитьКаталогиСверки = Истина, РасшифровкаРасчета = Неопределено) Экспорт
	
	ЗарегистрироватьСессиюСтатистики("ВыполнитьСверку");
	
	ЗаполнитьДанныеСверки(ДанныеСверки, ПерезаполнитьКаталогиСверки);
	
	// Получим данные банка
			
	СчитанныеДанные = Новый ТаблицаЗначений;
	СчитанныеДанные.Колонки.Добавить("Дата",				Новый ОписаниеТипов("Дата"));
	СчитанныеДанные.Колонки.Добавить("Банк",				Новый ОписаниеТипов("СправочникСсылка.Банки"));
	СчитанныеДанные.Колонки.Добавить("БанковскийСчет",		Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	СчитанныеДанные.Колонки.Добавить("НачальныйОстаток",	Новый ОписаниеТипов("Число"));
	СчитанныеДанные.Колонки.Добавить("Приход",				Новый ОписаниеТипов("Число"));
	СчитанныеДанные.Колонки.Добавить("Расход",				Новый ОписаниеТипов("Число"));
	СчитанныеДанные.Колонки.Добавить("КонечныйОстаток",		Новый ОписаниеТипов("Число"));
	СчитанныеДанные.Колонки.Добавить("ПутьКФайлу",			Новый ОписаниеТипов("Строка"));
	
	#Область Считываем_данные_из_файлов
	
	ДеньСверки = НачалоДня(ЭтотОбъект.Период.ДатаНачала);
	
	Пока ДеньСверки <= ЭтотОбъект.Период.ДатаОкончания Цикл
	
		Для Каждого СтрокаКаталога Из ЭтотОбъект.КаталогиСверки Цикл
			
			Каталог = СтрокаКаталога.Каталог;
			
			Если КонецДня(ЭтотОбъект.Период.ДатаНачала) <> КонецДня(ЭтотОбъект.Период.ДатаОкончания) Тогда 
				Каталог = ПланыВидовХарактеристик.ДополнительныеСведения.ОбработатьПутьКФайлу(Каталог, Новый Структура("Период", ДеньСверки));	
			КонецЕсли;				
			
			Если ПустаяСтрока(Каталог) Тогда
				Продолжить;
			КонецЕсли;
			
			КаталогиПоиска = СтрРазделить(Каталог, ";", Ложь);
			
			Для Каждого Каталог Из КаталогиПоиска Цикл
			
				НайденныеФайлы = НайтиФайлы(Каталог, "*.txt", Ложь);
				
				Для Каждого Файл Из НайденныеФайлы Цикл
					
					ТекстФайла = Новый ЧтениеТекста(Файл.ПолноеИмя, , , , Ложь);
					
					// Первая строка должна содержать описание формата 1С
					
					СтрокаФайла = ТекстФайла.ПрочитатьСтроку();
					
					Если СтрокаФайла <> "1CClientBankExchange" Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаФайла = ТекстФайла.ПрочитатьСтроку();
					
					// Перебираем остальные строки в поисках нужных данных
					
					ПропуститьФайл		= Ложь;
					СекцияСчетаНачалась = Ложь;
					ДанныеСчета			= Новый Структура("Дата, Банк, ПутьКФайлу, БанковскийСчет, ДатаНачала, ДатаОкончания, НачальныйОстаток, Приход, Расход, КонечныйОстаток",
						ДеньСверки, СтрокаКаталога.Банк, Файл.ПолноеИмя);
					
					Пока СтрокаФайла <> Неопределено Цикл
						
						Если СтрокаФайла = "СекцияРасчСчет" Тогда
							
							СекцияСчетаНачалась = Истина;
							
						ИначеЕсли СтрокаФайла = "КонецРасчСчет" Тогда
							
							Прервать;
								
						ИначеЕсли СекцияСчетаНачалась Тогда
							
							Если СтрНачинаетсяС(СтрокаФайла, "ДатаНачала=") Тогда
							
								Значение = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Сред(СтрокаФайла, СтрДлина("ДатаНачала=") + 1));
								Если Значение <> ДеньСверки Тогда
									ПропуститьФайл = Истина;
									Прервать;
								КонецЕсли;
								
								ДанныеСчета.ДатаНачала = Значение;
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "ДатаКонца=") Тогда
							
								Значение = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Сред(СтрокаФайла, СтрДлина("ДатаКонца=") + 1));
								Если Значение <> ДеньСверки Тогда
									ПропуститьФайл = Истина;
									Прервать;
								КонецЕсли;
								
								ДанныеСчета.ДатаОкончания = Значение;
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "РасчСчет=") Тогда
								
								ДанныеСчета.БанковскийСчет = Сред(СтрокаФайла, СтрДлина("РасчСчет=") + 1);
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "НачальныйОстаток=") Тогда
								
								ДанныеСчета.НачальныйОстаток = Число(Сред(СтрокаФайла, СтрДлина("НачальныйОстаток=") + 1));
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "ВсегоПоступило=") Тогда
								
								ДанныеСчета.Приход = Число(Сред(СтрокаФайла, СтрДлина("ВсегоПоступило=") + 1));
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "ВсегоСписано=") Тогда
								
								ДанныеСчета.Расход = Число(Сред(СтрокаФайла, СтрДлина("ВсегоСписано=") + 1));
								
							ИначеЕсли СтрНачинаетсяС(СтрокаФайла, "КонечныйОстаток=") Тогда
								
								ДанныеСчета.КонечныйОстаток = Число(Сред(СтрокаФайла, СтрДлина("КонечныйОстаток=") + 1));
								
							КонецЕсли;
							
						КонецЕсли;

						СтрокаФайла = ТекстФайла.ПрочитатьСтроку();
						
					КонецЦикла;
					
					Если Не ПропуститьФайл Тогда
						
						Если ЗначениеЗаполнено(ДанныеСчета.БанковскийСчет) И ЗначениеЗаполнено(ДанныеСчета.ДатаНачала) И ЗначениеЗаполнено(ДанныеСчета.ДатаОкончания) Тогда
						
							ЗаполнитьЗначенияСвойств(СчитанныеДанные.Добавить(), ДанныеСчета);
							
						Иначе
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректный формат файла: " + Файл.ПолноеИмя);
							
						КонецЕсли;
						
					КонецЕсли;			
					
				КонецЦикла;
				
			КонецЦикла;
		
		КонецЦикла;
		
		ДеньСверки = ДеньСверки + 86400;	
		
	КонецЦикла;		
	
	#КонецОбласти
	
	// Сопоставим считанные данные с данными 1С
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область Текст_запроса_сверки
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчитанныеДанные.Дата КАК Дата,
		|	СчитанныеДанные.Банк КАК Банк,
		|	СчитанныеДанные.БанковскийСчет КАК БанковскийСчет,
		|	СчитанныеДанные.НачальныйОстаток КАК НачальныйОстаток,
		|	СчитанныеДанные.Приход КАК Приход,
		|	СчитанныеДанные.Расход КАК Расход,
		|	СчитанныеДанные.КонечныйОстаток КАК КонечныйОстаток,
		|	ВЫРАЗИТЬ(СчитанныеДанные.ПутьКФайлу КАК СТРОКА(256)) КАК ПутьКФайлу
		|ПОМЕСТИТЬ _СчитанныеДанныеИсходные
		|ИЗ
		|	&СчитанныеДанные КАК СчитанныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчитанныеДанныеИсходные.Дата КАК Дата,
		|	_СчитанныеДанныеИсходные.Банк КАК Банк,
		|	ЕСТЬNULL(БанковскиеСчета.Ссылка, _СчитанныеДанныеИсходные.БанковскийСчет) КАК БанковскийСчет,
		|	БанковскиеСчета.Валюта КАК ВалютаСчета,
		|	_СчитанныеДанныеИсходные.НачальныйОстаток КАК НачальныйОстаток,
		|	_СчитанныеДанныеИсходные.Приход КАК Приход,
		|	_СчитанныеДанныеИсходные.Расход КАК Расход,
		|	_СчитанныеДанныеИсходные.КонечныйОстаток КАК КонечныйОстаток,
		|	_СчитанныеДанныеИсходные.ПутьКФайлу КАК ПутьКФайлу
		|ПОМЕСТИТЬ _СчитанныеДанныеСопоставленные
		|ИЗ
		|	_СчитанныеДанныеИсходные КАК _СчитанныеДанныеИсходные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (БанковскиеСчета.Организация = &Организация)
		|			И (БанковскиеСчета.Банк = _СчитанныеДанныеИсходные.Банк)
		|			И (БанковскиеСчета.НомерСчета = _СчитанныеДанныеИсходные.БанковскийСчет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК СчетаУчетКоторыхВедетсяВДругойСистеме
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК СвойствоУчетНеВедется
		|			ПО (СвойствоУчетНеВедется.Ссылка = СчетаУчетКоторыхВедетсяВДругойСистеме.Свойство)
		|				И (СвойствоУчетНеВедется.Ключ = ""УчетНеВедется"")
		|		ПО (СчетаУчетКоторыхВедетсяВДругойСистеме.Объект = БанковскиеСчета.Ссылка)
		|			И (СчетаУчетКоторыхВедетсяВДругойСистеме.Значение = ИСТИНА)
		|ГДЕ
		|	НЕ(&ИсключитьИзДанныхБанкаТранзитныеВалютныеСчета
		|				И ЕСТЬNULL(БанковскиеСчета.Транзитный, ЛОЖЬ))
		|	И (НЕ &ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме
		|			ИЛИ СчетаУчетКоторыхВедетсяВДругойСистеме.Объект ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчитанныеДанныеСопоставленные.Дата КАК Дата,
		|	_СчитанныеДанныеСопоставленные.Банк КАК Банк,
		|	_СчитанныеДанныеСопоставленные.БанковскийСчет КАК БанковскийСчет,
		|	_СчитанныеДанныеСопоставленные.ВалютаСчета КАК ВалютаСчета,
		|	_СчитанныеДанныеСопоставленные.НачальныйОстаток КАК НачальныйОстаток,
		|	_СчитанныеДанныеСопоставленные.Приход КАК Приход,
		|	_СчитанныеДанныеСопоставленные.Расход КАК Расход,
		|	_СчитанныеДанныеСопоставленные.КонечныйОстаток КАК КонечныйОстаток,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(_СчитанныеДанныеСопоставленные.ПутьКФайлу) = МИНИМУМ(_СчитанныеДанныеСопоставленные.ПутьКФайлу)
		|			ТОГДА МАКСИМУМ(_СчитанныеДанныеСопоставленные.ПутьКФайлу)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПутьКФайлу
		|ПОМЕСТИТЬ _СчитанныеДанные
		|ИЗ
		|	_СчитанныеДанныеСопоставленные КАК _СчитанныеДанныеСопоставленные
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчитанныеДанныеСопоставленные.Дата,
		|	_СчитанныеДанныеСопоставленные.Банк,
		|	_СчитанныеДанныеСопоставленные.БанковскийСчет,
		|	_СчитанныеДанныеСопоставленные.ВалютаСчета,
		|	_СчитанныеДанныеСопоставленные.НачальныйОстаток,
		|	_СчитанныеДанныеСопоставленные.Приход,
		|	_СчитанныеДанныеСопоставленные.Расход,
		|	_СчитанныеДанныеСопоставленные.КонечныйОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчитанныеДанные.Банк КАК Банк,
		|	_СчитанныеДанные.БанковскийСчет КАК БанковскийСчет,
		|	ВЫРАЗИТЬ(СУММА(ВЫБОР
		|				КОГДА _СчитанныеДанные.Дата = ГраницыДанных.МинимальнаяДата
		|					ТОГДА _СчитанныеДанные.НачальныйОстаток * ЕСТЬNULL(КурсВалютыСчетаНачальногоОстатка.Курс / КурсВалютыСчетаНачальногоОстатка.Кратность, 1)
		|			КОНЕЦ) КАК ЧИСЛО(1, 0)) КАК НачальныйОстаток,
		|	ВЫРАЗИТЬ(СУММА(_СчитанныеДанные.Приход * ЕСТЬNULL(КурсВалютыСчета.Курс / КурсВалютыСчета.Кратность, 1)) КАК ЧИСЛО(1, 0)) КАК Приход,
		|	ВЫРАЗИТЬ(СУММА(_СчитанныеДанные.Расход * ЕСТЬNULL(КурсВалютыСчета.Курс / КурсВалютыСчета.Кратность, 1)) КАК ЧИСЛО(1, 0)) КАК Расход,
		|	ВЫРАЗИТЬ(СУММА(ВЫБОР
		|				КОГДА _СчитанныеДанные.Дата = ГраницыДанных.МаксимальнаяДата
		|					ТОГДА _СчитанныеДанные.КонечныйОстаток * ЕСТЬNULL(КурсВалютыСчетаКонечногоОстатка.Курс / КурсВалютыСчетаКонечногоОстатка.Кратность, 1)
		|			КОНЕЦ) КАК ЧИСЛО(1, 0)) КАК КонечныйОстаток,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(_СчитанныеДанные.ПутьКФайлу) = МИНИМУМ(_СчитанныеДанные.ПутьКФайлу)
		|			ТОГДА МАКСИМУМ(_СчитанныеДанные.ПутьКФайлу)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПутьКФайлу
		|ПОМЕСТИТЬ _ДанныеБанка
		|ИЗ
		|	_СчитанныеДанные КАК _СчитанныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СчитанныеДанные.Банк КАК Банк,
		|			_СчитанныеДанные.БанковскийСчет КАК БанковскийСчет,
		|			МИНИМУМ(_СчитанныеДанные.Дата) КАК МинимальнаяДата,
		|			МАКСИМУМ(_СчитанныеДанные.Дата) КАК МаксимальнаяДата
		|		ИЗ
		|			_СчитанныеДанные КАК _СчитанныеДанные
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СчитанныеДанные.Банк,
		|			_СчитанныеДанные.БанковскийСчет) КАК ГраницыДанных
		|		ПО (ГраницыДанных.Банк = _СчитанныеДанные.Банк)
		|			И (ГраницыДанных.БанковскийСчет = _СчитанныеДанные.БанковскийСчет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСчета
		|		ПО (КурсВалютыСчета.Валюта = _СчитанныеДанные.ВалютаСчета)
		|			И (КурсВалютыСчета.Период = _СчитанныеДанные.Дата)
		|			И (&СверятьСуммыВВалютеУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСчетаНачальногоОстатка
		|		ПО (КурсВалютыСчетаНачальногоОстатка.Валюта = _СчитанныеДанные.ВалютаСчета)
		|			И (КурсВалютыСчетаНачальногоОстатка.Период = ВЫБОР
		|				КОГДА &НачальныйОстатокПоКурсуПредыдущегоДня
		|					ТОГДА ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -1)
		|				ИНАЧЕ &ДатаНачала
		|			КОНЕЦ)
		|			И (&СверятьСуммыВВалютеУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютыСчетаКонечногоОстатка
		|		ПО (КурсВалютыСчетаКонечногоОстатка.Валюта = _СчитанныеДанные.ВалютаСчета)
		|			И (КурсВалютыСчетаКонечногоОстатка.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|			И (&СверятьСуммыВВалютеУчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчитанныеДанные.Банк,
		|	_СчитанныеДанные.БанковскийСчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_СчитанныеДанные.Банк
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные1С.Банк КАК Банк,
		|	Данные1С.БанковскийСчет КАК БанковскийСчет,
		|	Данные1С.НачальныйОстаток КАК НачальныйОстаток,
		|	Данные1С.Приход КАК Приход,
		|	Данные1С.Расход КАК Расход,
		|	Данные1С.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ _Данные1С
		|ИЗ
		|	&Данные1С КАК Данные1С
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_Данные1С.Банк, _ДанныеБанка.Банк) КАК Банк,
		|	ЕСТЬNULL(_Данные1С.БанковскийСчет, _ДанныеБанка.БанковскийСчет) КАК БанковскийСчет,
		|	_Данные1С.НачальныйОстаток КАК НачальныйОстаток,
		|	_Данные1С.Приход КАК Приход,
		|	_Данные1С.Расход КАК Расход,
		|	_Данные1С.КонечныйОстаток КАК КонечныйОстаток,
		|	_ДанныеБанка.НачальныйОстаток КАК НачальныйОстатокБанк,
		|	_ДанныеБанка.Приход КАК ПриходБанк,
		|	_ДанныеБанка.Расход КАК РасходБанк,
		|	_ДанныеБанка.КонечныйОстаток КАК КонечныйОстатокБанк,
		|	_ДанныеБанка.ПутьКФайлу КАК ПутьКФайлу,
		|	ВЫБОР
		|		КОГДА _Данные1С.НачальныйОстаток = _ДанныеБанка.НачальныйОстаток
		|				И _Данные1С.Приход = _ДанныеБанка.Приход
		|				И _Данные1С.Расход = _ДанныеБанка.Расход
		|				И _Данные1С.КонечныйОстаток = _ДанныеБанка.КонечныйОстаток
		|			ТОГДА &РезультатСверено
		|		КОГДА &ПриОтсутствииВ1СНулевыеДанныеБанкаСчитатьСверенными
		|				И (_Данные1С.БанковскийСчет ЕСТЬ NULL
		|					И _ДанныеБанка.НачальныйОстаток = 0
		|					И _ДанныеБанка.Приход = 0
		|					И _ДанныеБанка.Расход = 0
		|					И _ДанныеБанка.КонечныйОстаток = 0)
		|			ТОГДА &РезультатСверено
		|		КОГДА &ПриОтсутствииВБанкеНулевыеДанные1ССчитатьСверенными
		|				И (_ДанныеБанка.БанковскийСчет ЕСТЬ NULL
		|					И _Данные1С.НачальныйОстаток = 0
		|					И _Данные1С.Приход = 0
		|					И _Данные1С.Расход = 0
		|					И _Данные1С.КонечныйОстаток = 0)
		|			ТОГДА &РезультатСверено
		|		КОГДА _Данные1С.БанковскийСчет ЕСТЬ NULL
		|				ИЛИ _ДанныеБанка.БанковскийСчет ЕСТЬ NULL
		|			ТОГДА &РезультатНеСверялось
		|		ИНАЧЕ &РезультатРасхождения
		|	КОНЕЦ КАК РезультатСверки
		|ИЗ
		|	_Данные1С КАК _Данные1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеБанка КАК _ДанныеБанка
		|		ПО _Данные1С.Банк = _ДанныеБанка.Банк
		|			И _Данные1С.БанковскийСчет = _ДанныеБанка.БанковскийСчет";
	
	ТипДенежныеСуммы = Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип.КвалификаторыЧисла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(1, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипДенежныеСуммы.Разрядность, ТипДенежныеСуммы.РазрядностьДробнойЧасти));
	
	#КонецОбласти	
	
	#Область Заполняем_параметры_сверки_значениями_по_умолчанию
	
	Если ПараметрыСверки = Неопределено Тогда
		ПараметрыСверки = Новый Структура;
	КонецЕсли;
	
	Если Не ПараметрыСверки.Свойство("СверятьСуммыВВалютеУчета") Тогда
		ПараметрыСверки.Вставить("СверятьСуммыВВалютеУчета", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыСверки.Свойство("НачальныйОстатокПоКурсуПредыдущегоДня") Тогда
		ПараметрыСверки.Вставить("НачальныйОстатокПоКурсуПредыдущегоДня", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыСверки.Свойство("ПриОтсутствииВ1СНулевыеДанныеБанкаСчитатьСверенными") Тогда
		ПараметрыСверки.Вставить("ПриОтсутствииВ1СНулевыеДанныеБанкаСчитатьСверенными", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыСверки.Свойство("ПриОтсутствииВБанкеНулевыеДанные1ССчитатьСверенными") Тогда
		ПараметрыСверки.Вставить("ПриОтсутствииВБанкеНулевыеДанные1ССчитатьСверенными", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыСверки.Свойство("ИсключитьИзДанныхБанкаТранзитныеВалютныеСчета") Тогда
		ПараметрыСверки.Вставить("ИсключитьИзДанныхБанкаТранзитныеВалютныеСчета", Ложь);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчитанныеДанные",		СчитанныеДанные);
	Запрос.УстановитьПараметр("Данные1С",				ЭтотОбъект.БанковскиеСчета);
	Запрос.УстановитьПараметр("ДатаНачала",				ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",			ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("СверятьСуммыВВалютеУчета",								ПараметрыСверки.СверятьСуммыВВалютеУчета);
	Запрос.УстановитьПараметр("НачальныйОстатокПоКурсуПредыдущегоДня",					ПараметрыСверки.НачальныйОстатокПоКурсуПредыдущегоДня);
	Запрос.УстановитьПараметр("ПриОтсутствииВ1СНулевыеДанныеБанкаСчитатьСверенными",	ПараметрыСверки.ПриОтсутствииВ1СНулевыеДанныеБанкаСчитатьСверенными);
	Запрос.УстановитьПараметр("ПриОтсутствииВБанкеНулевыеДанные1ССчитатьСверенными",	ПараметрыСверки.ПриОтсутствииВБанкеНулевыеДанные1ССчитатьСверенными);
	Запрос.УстановитьПараметр("ИсключитьИзДанныхБанкаТранзитныеВалютныеСчета",			ПараметрыСверки.ИсключитьИзДанныхБанкаТранзитныеВалютныеСчета);
	Запрос.УстановитьПараметр("ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме",			ЭтотОбъект.ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме);
	
	Запрос.УстановитьПараметр("РезультатСверено",		ОписаниеРезультатовСверки.Сверено.Значение);
	Запрос.УстановитьПараметр("РезультатРасхождения",	ОписаниеРезультатовСверки.Расхождения.Значение);
	Запрос.УстановитьПараметр("РезультатНеСверялось",	ОписаниеРезультатовСверки.НеСверялось.Значение);
	
	РезультатыСверки = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.БанковскиеСчета.Загрузить(РезультатыСверки);
	
	// Заполним данные расшифровки
	
	Если ТипЗнч(РасшифровкаРасчета) = Тип("Структура") Тогда
		РасшифровкаРасчета.Вставить("СчитанныеДанные", Запрос.МенеджерВременныхТаблиц.Таблицы["_СчитанныеДанныеСопоставленные"].ПолучитьДанные().Выгрузить());			
	КонецЕсли;
	
	// К успешным сверкам относим случаи, когда нечего сверять, либо когда все сверено
	
	РезультатыСверки.Свернуть("РезультатСверки");
	
	ЗарегистрироватьОкончаниеСессииСтатистики("ВыполнитьСверку");
	
	Возврат (РезультатыСверки.Количество() = 0 ИЛИ РезультатыСверки.Количество() = 1 И РезультатыСверки[0].РезультатСверки = ОписаниеРезультатовСверки.Сверено.Значение);
	
КонецФункции

Функция СформироватьОтчетОРезультатахСверки() Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	// Шапка
	
	Макет = ЭтотОбъект.ПолучитьМакет("РезультыСверки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ЭтотОбъект);
	ОбластьШапка.Параметры.ПериодСверки = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	// Результаты сверки
	
	#Область Группировка_данных_для_отчета
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезультатыСверки.Банк КАК Банк,
		|	РезультатыСверки.БанковскийСчет КАК БанковскийСчет,
		|	РезультатыСверки.НачальныйОстаток КАК НачальныйОстаток,
		|	РезультатыСверки.Приход КАК Приход,
		|	РезультатыСверки.Расход КАК Расход,
		|	РезультатыСверки.КонечныйОстаток КАК КонечныйОстаток,
		|	РезультатыСверки.НачальныйОстатокБанк КАК НачальныйОстатокБанк,
		|	РезультатыСверки.ПриходБанк КАК ПриходБанк,
		|	РезультатыСверки.РасходБанк КАК РасходБанк,
		|	РезультатыСверки.КонечныйОстатокБанк КАК КонечныйОстатокБанк,
		|	РезультатыСверки.РезультатСверки КАК РезультатСверки
		|ПОМЕСТИТЬ _РезультатыСверки
		|ИЗ
		|	&РезультатыСверки КАК РезультатыСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыРезультатовСверки.Значение КАК Значение,
		|	ВариантыРезультатовСверки.Представление КАК Представление,
		|	ВариантыРезультатовСверки.Приоритет КАК Приоритет,
		|	ВариантыРезультатовСверки.ЦветТекста КАК ЦветТекста
		|ПОМЕСТИТЬ _ВариантыРезультатовСверки
		|ИЗ
		|	&ВариантыРезультатовСверки КАК ВариантыРезультатовСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РезультатыСверки.Банк КАК Банк,
		|	_РезультатыСверки.БанковскийСчет КАК БанковскийСчет,
		|	ВЫРАЗИТЬ(_РезультатыСверки.БанковскийСчет КАК Справочник.БанковскиеСчета).ВидБанковскогоСчета КАК ВидБанковскогоСчета,
		|	_РезультатыСверки.НачальныйОстаток КАК НачальныйОстаток,
		|	_РезультатыСверки.Приход КАК Приход,
		|	_РезультатыСверки.Расход КАК Расход,
		|	_РезультатыСверки.КонечныйОстаток КАК КонечныйОстаток,
		|	_РезультатыСверки.НачальныйОстатокБанк КАК НачальныйОстатокБанк,
		|	_РезультатыСверки.ПриходБанк КАК ПриходБанк,
		|	_РезультатыСверки.РасходБанк КАК РасходБанк,
		|	_РезультатыСверки.КонечныйОстатокБанк КАК КонечныйОстатокБанк,
		|	_РезультатыСверки.РезультатСверки КАК РезультатСверки,
		|	ЕСТЬNULL(_ВариантыРезультатовСверки.Представление, _ВариантРезультатаНеСверялось.Представление) КАК ПредставлениеРезультата,
		|	ЕСТЬNULL(_ВариантыРезультатовСверки.Приоритет, _ВариантРезультатаНеСверялось.Приоритет) КАК ПриоритетРезультата,
		|	ЕСТЬNULL(_ВариантыРезультатовСверки.ЦветТекста, _ВариантРезультатаНеСверялось.ЦветТекста) КАК ЦветТекстаРезультата
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_РезультатыСверки КАК _РезультатыСверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРезультатовСверки КАК _ВариантыРезультатовСверки
		|		ПО (_ВариантыРезультатовСверки.Значение = _РезультатыСверки.РезультатСверки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРезультатовСверки КАК _ВариантРезультатаНеСверялось
		|		ПО (_ВариантРезультатаНеСверялось.Значение = &РезультатНеСверялось)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.Банк КАК Банк,
		|	ПРЕДСТАВЛЕНИЕ(_ИтоговаяТаблица.Банк) КАК БанкПредставление,
		|	_ИтоговаяТаблица.БанковскийСчет КАК БанковскийСчет,
		|	ПРЕДСТАВЛЕНИЕ(_ИтоговаяТаблица.БанковскийСчет) КАК БанковскийСчетПредставление,
		|	_ИтоговаяТаблица.ВидБанковскогоСчета КАК ВидБанковскогоСчета,
		|	ПРЕДСТАВЛЕНИЕ(_ИтоговаяТаблица.ВидБанковскогоСчета) КАК ВидБанковскогоСчетаПредставление,
		|	_ИтоговаяТаблица.НачальныйОстаток КАК НачальныйОстаток,
		|	_ИтоговаяТаблица.Приход КАК Приход,
		|	_ИтоговаяТаблица.Расход КАК Расход,
		|	_ИтоговаяТаблица.КонечныйОстаток КАК КонечныйОстаток,
		|	_ИтоговаяТаблица.НачальныйОстатокБанк КАК НачальныйОстатокБанк,
		|	_ИтоговаяТаблица.ПриходБанк КАК ПриходБанк,
		|	_ИтоговаяТаблица.РасходБанк КАК РасходБанк,
		|	_ИтоговаяТаблица.КонечныйОстатокБанк КАК КонечныйОстатокБанк,
		|	_ИтоговаяТаблица.РезультатСверки КАК РезультатСверки,
		|	_ИтоговаяТаблица.ПредставлениеРезультата КАК ПредставлениеРезультата,
		|	_ИтоговаяТаблица.ПриоритетРезультата КАК ПриоритетРезультата,
		|	_ИтоговаяТаблица.ЦветТекстаРезультата КАК ЦветТекстаРезультата,
		|	ПриоритетРезультатовПоБанку.ПриоритетРезультата КАК ПриоритетРезультатаПоБанку
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ИтоговаяТаблица.Банк КАК Банк,
		|			МИНИМУМ(_ИтоговаяТаблица.ПриоритетРезультата) КАК ПриоритетРезультата
		|		ИЗ
		|			_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ИтоговаяТаблица.Банк) КАК ПриоритетРезультатовПоБанку
		|		ПО (ПриоритетРезультатовПоБанку.Банк = _ИтоговаяТаблица.Банк)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ИтоговаяТаблица.ПриоритетРезультата,
		|	_ИтоговаяТаблица.Банк,
		|	_ИтоговаяТаблица.БанковскийСчет
		|ИТОГИ
		|	КОЛИЧЕСТВО(БанковскийСчет),
		|	МИНИМУМ(РезультатСверки),
		|	МИНИМУМ(ПредставлениеРезультата),
		|	МИНИМУМ(ЦветТекстаРезультата)
		|ПО
		|	ПриоритетРезультатаПоБанку,
		|	Банк,
		|	ПриоритетРезультата
		|АВТОУПОРЯДОЧИВАНИЕ");
	
	ВариантыРезультатовСверки = Новый ТаблицаЗначений;
	ВариантыРезультатовСверки.Колонки.Добавить("Значение",		Новый ОписаниеТипов("Число"));
	ВариантыРезультатовСверки.Колонки.Добавить("Представление",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ВариантыРезультатовСверки.Колонки.Добавить("Приоритет",		Новый ОписаниеТипов("Число"));
	ВариантыРезультатовСверки.Колонки.Добавить("ЦветТекста",	Новый ОписаниеТипов("Строка"));
	
	Для Каждого ВариантРезультата Из ОписаниеРезультатовСверки Цикл
		ОписаниеВарианта = ВариантыРезультатовСверки.Добавить();
		ЗаполнитьЗначенияСвойств(ОписаниеВарианта, ВариантРезультата.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("РезультатыСверки",			ЭтотОбъект.БанковскиеСчета);
	Запрос.УстановитьПараметр("ВариантыРезультатовСверки",	ВариантыРезультатовСверки);
	Запрос.УстановитьПараметр("РезультатНеСверялось",		ОписаниеРезультатовСверки.НеСверялось.Значение);
	
	#КонецОбласти
	
	СверяемыеПоля = РаботаСКоллекциями.ЗначенияВМассив("НачальныйОстаток", "Приход", "Расход", "КонечныйОстаток");
	
	ВыборкаПоРезультатуПоБанку = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоРезультатуПоБанку.Следующий() Цикл
	
		ВыборкаПоБанку = ВыборкаПоРезультатуПоБанку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоБанку.Следующий() Цикл
			
			ОбластьБанк = Макет.ПолучитьОбласть("Банк");
			ОбластьБанк.Параметры.Заполнить(ВыборкаПоБанку);
		
			ДокументРезультат.Вывести(ОбластьБанк);
			
			// Группировка по результату сверки
			
			ДокументРезультат.НачатьГруппуСтрок();
			
			ВыборкаПоРезультату = ВыборкаПоБанку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоРезультату.Следующий() Цикл
				
				ОбластьРезультат = Макет.ПолучитьОбласть("РезультатСверки");
				ОбластьРезультат.Параметры.Заполнить(ВыборкаПоРезультату);
				ОбластьРезультат.Область().ЦветТекста = WebЦвета[ВыборкаПоРезультату.ЦветТекстаРезультата];				
				
				ДокументРезультат.Вывести(ОбластьРезультат);
				
				// Шапка счетов
				
				ДокументРезультат.НачатьГруппуСтрок(, ВыборкаПоРезультату.РезультатСверки <> ОписаниеРезультатовСверки.Сверено.Значение);
				
				ОбластьРезультат = Макет.ПолучитьОбласть("БанковскийСчетШапка");
				ОбластьРезультат.Параметры.Заполнить(ВыборкаПоРезультату);
							
				ДокументРезультат.Вывести(ОбластьРезультат);
				
				// Счета
				
				ВыборкаПоСчету = ВыборкаПоРезультату.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				Пока ВыборкаПоСчету.Следующий() Цикл
					
					ОбластьСчет = Макет.ПолучитьОбласть("БанковскийСчет");
					ОбластьСчет.Параметры.Заполнить(ВыборкаПоСчету);
					
					Если ВыборкаПоРезультату.РезультатСверки = ОписаниеРезультатовСверки.Расхождения.Значение Тогда
						Для Каждого Поле Из СверяемыеПоля Цикл
							Если ВыборкаПоСчету[Поле] <> ВыборкаПоСчету[Поле + "Банк"] Тогда
								ОбластьСчет.Области[Поле].ЦветТекста = WebЦвета[ВыборкаПоРезультату.ЦветТекстаРезультата];	
							КонецЕсли;							
						КонецЦикла; 
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьСчет);
					
				КонецЦикла;
				
				ДокументРезультат.ЗакончитьГруппуСтрок();
				
			КонецЦикла;
			
			ДокументРезультат.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
	КонецЦикла;

	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчетОРезультатахСверки", Истина, ОриентацияСтраницы.Портрет);		
	
	Возврат ДокументРезультат;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтотОбъект.Период, , , ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Период", Отказ); 	
	КонецЕсли;
	
КонецПроцедуры

#Область Регистрация_статистики_выполнения

Процедура ЗарегистрироватьСессиюСтатистики(ИдентификаторКоманды)
	
	// Если сессия уже зарегистрирована, еще одну не регистрируем
	
	Если ДополнительныеСвойства.Свойство("СтатистикаРаботыВнутреннихМеханизмов") Тогда
		Возврат;
	КонецЕсли;
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды;
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	ДополнительныеСвойства.Вставить("СтатистикаРаботыВнутреннихМеханизмов", Новый Структура("ИдентификаторКоманды, Механизм, Сессия", ИдентификаторКоманды, Механизм, Сессия));
	
КонецПроцедуры

Процедура ЗарегистрироватьОкончаниеСессииСтатистики(ИдентификаторКоманды)
	
	// Сессию завершает та команда, что ее запустила
	
	Если ДополнительныеСвойства.СтатистикаРаботыВнутреннихМеханизмов.ИдентификаторКоманды <> ИдентификаторКоманды Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ДополнительныеСвойства.СтатистикаРаботыВнутреннихМеханизмов.Механизм,
		ДополнительныеСвойства.СтатистикаРаботыВнутреннихМеханизмов.Сессия);
		
	ДополнительныеСвойства.Удалить("СтатистикаРаботыВнутреннихМеханизмов");		
		
КонецПроцедуры

#КонецОбласти

ДополнительныеСвойства		= Новый Структура;
ОписаниеРезультатовСверки	= ВариантыЗначенийРезультатаСверки();
